src/config/Catalogs/ПараметрыПоказателейЭффективности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПараметрыПоказателейЭффективности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>cfg:EnumRef.ВидыТоваров</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Типоразмеры</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.МоделиТоваров</v8:Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Catalogs/ПараметрыПоказателейЭффективности/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	# Если Клиент Тогда
	Для каждого СтрСписок из СписокПараметров Цикл
		Если ТипЗнч(СтрСписок.Параметр) = Тип("Строка") и ЗначениеНеЗаполнено(СтрСписок.ТипПараметра) Тогда
			Сообщить("Необходимо заполнить тип параметра");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	ТЗПараметры = СписокПараметров.Выгрузить();
	ТЗПараметры.Свернуть("ВидСравнения, ТипПараметра");
	Для Каждого СтрПар из ТЗПараметры Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ВидСравнения", СтрПар.ВидСравнения);
		Отбор.Вставить("ТипПараметра", СтрПар.ТипПараметра);
		Строки = СписокПараметров.НайтиСтроки(Отбор);
		Если Строки.Количество() >1 и (СтрПар.ВидСравнения = "Содержит" или СтрПар.ВидСравнения = "Не содержит")  Тогда
			Сообщить("Можно добавить лишь одно сравнение " + СтрПар.ВидСравнения);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	# КонецЕсли
КонецПроцедуры
